Revit 2020 API
ImageImportOptions Members
The ImageImportOptions type exposes the following members.
Constructors
Name | Description
ImageImportOptions
Default constructor. Sets all options to their default values.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Placement
Identifies which point of the image will be aligned to the placement point RefPoint.
RefPoint
Reference point (in Revit) to which the image is going to be inserted.
 (Inherited from GenericImportOptions.)
Resolution
Resolution to use (in dpi) for the image to be imported.
See Also
ImageImportOptions Class
Autodesk.Revit.DB Namespace